/**************************************************************************//*!
 *  @file           hal.h
 *  @brief          [HAL] 外部公開 API を宣言したヘッダファイル。
 *  @author         Ryoji Morita
 *  @attention      none.
 *                  関数命名規則
 *                      通常         : Hal[デバイス名]_処理名()
 *                      割込ハンドラ : Hal[デバイス名]_IH_処理名()
 *  @sa             none.
 *  @bug            none.
 *  @warning        none.
 *  @version        1.00
 *  @last updated   2016.06.05
 *************************************************************************** */

// 多重コンパイル抑止
#ifndef _HAL_H_
#define _HAL_H_


//********************************************************
/* include                                               */
//********************************************************
#include "hal_cmn.h"


//********************************************************
/*! @def                                                 */
//********************************************************
/* NULL */
#ifndef NULL
#define NULL                (0)
#endif

/* OFF */
#ifndef OFF
#define OFF                 (0)
#endif

/* ON */
#ifndef ON
#define ON                  (1)
#endif


//********************************************************
/*! @enum                                                */
//********************************************************
// なし


//********************************************************
/*! @struct                                              */
//********************************************************
// なし


//********************************************************
/* 関数プロトタイプ宣言                                  */
//********************************************************
// LED API
EHalBool_t      HalLed_Init( void );
void            HalLed_Fini( void );
void            HalLed_Set( unsigned int value );
void            HalLed_Sequence( void );


#endif /* _HAL_H_ */

